Revit 2027 API
RevitLinkGraphicsSettings.GetPhaseFilterType Method
 The phase filter type of RevitLinkGraphicsSettings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LinkVisibility GetPhaseFilterType()
Public Function GetPhaseFilterType As LinkVisibility
public:
LinkVisibility GetPhaseFilterType()
member GetPhaseFilterType : unit -> LinkVisibility
Return Value
LinkVisibility
See Also
Reference
RevitLinkGraphicsSettings Class
Autodesk.Revit.DB Namespace